
## Terraform Plan of GCP
#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
Acquiring state lock. This may take a few moments...
google_secret_manager_secret.igsr5_daily_database_url: Refreshing state... [id=projects/igsr5-368506/secrets/igsr5-daily--database-url]
data.google_iam_policy.igsr5_daily_cloud_run: Reading...
google_secret_manager_secret.igsr5-daily_slack_signing_secret: Refreshing state... [id=projects/igsr5-368506/secrets/igsr5-daily--slack-signing-secret]
data.google_iam_policy.github_project_automation_prototype_cloud_run: Reading...
google_secret_manager_secret.igsr5-daily_slack_webhook_url: Refreshing state... [id=projects/igsr5-368506/secrets/igsr5-daily--slack-webhook-url]
google_service_account.github_project_automation_prototype_sa: Refreshing state... [id=projects/igsr5-368506/serviceAccounts/cloud-run-invoker-sa-g-p-a-p@igsr5-368506.iam.gserviceaccount.com]
google_service_account.igsr5_daily_sa: Refreshing state... [id=projects/igsr5-368506/serviceAccounts/cloud-run-invoker-sa-i-d@igsr5-368506.iam.gserviceaccount.com]
google_cloud_run_service.github_project_automation_prototype: Refreshing state... [id=locations/asia-northeast1/namespaces/igsr5-368506/services/github-project-automation-prototype]
google_cloud_scheduler_job.github_project_automation_prototype: Refreshing state... [id=projects/igsr5-368506/locations/asia-northeast1/jobs/github-project-automation-prototype]
google_cloud_run_service.igsr5_daily: Refreshing state... [id=locations/asia-northeast1/namespaces/igsr5-368506/services/igsr5-daily]
data.google_iam_policy.github_project_automation_prototype_cloud_run: Read complete after 0s [id=3818910945]
data.google_iam_policy.igsr5_daily_cloud_run: Read complete after 0s [id=3818910945]
google_secret_manager_secret.github_project_automation_prototype_gh_token: Refreshing state... [id=projects/igsr5-368506/secrets/github-project-automation-prototype-gh-token]
google_cloud_run_service.attendance_request_bot: Refreshing state... [id=locations/asia-northeast1/namespaces/igsr5-368506/services/attendance-request-bot]
google_secret_manager_secret.igsr5_daily_slack_bot_token: Refreshing state... [id=projects/igsr5-368506/secrets/igsr5-daily--slack-bot-token]
google_service_account.attendance_request_scheduler_sa: Refreshing state... [id=projects/igsr5-368506/serviceAccounts/cloud-run-invoker-sa-a-r-s@igsr5-368506.iam.gserviceaccount.com]
google_secret_manager_secret.igsr5-daily_slack_admin_user_id: Refreshing state... [id=projects/igsr5-368506/secrets/igsr5-daily--slack-admin-user-id]
google_secret_manager_secret_iam_policy.github_project_automation_prototype_gh_token: Refreshing state... [id=projects/igsr5-368506/secrets/github-project-automation-prototype-gh-token]
google_secret_manager_secret_iam_policy.igsr5_daily_slack_signing_secret: Refreshing state... [id=projects/igsr5-368506/secrets/igsr5-daily--slack-signing-secret]
google_secret_manager_secret_iam_policy.igsr5_daily_slack_webhook_url: Refreshing state... [id=projects/igsr5-368506/secrets/igsr5-daily--slack-webhook-url]
google_secret_manager_secret_iam_policy.igsr5_daily_database_url: Refreshing state... [id=projects/igsr5-368506/secrets/igsr5-daily--database-url]
google_secret_manager_secret_iam_policy.igsr5_daily_slack_bot_token: Refreshing state... [id=projects/igsr5-368506/secrets/igsr5-daily--slack-bot-token]
google_secret_manager_secret_iam_policy.igsr5_daily_slack_admin_user_id: Refreshing state... [id=projects/igsr5-368506/secrets/igsr5-daily--slack-admin-user-id]
data.google_iam_policy.attendance_request_scheduler_sa_invoker: Reading...
data.google_iam_policy.attendance_request_scheduler_sa_invoker: Read complete after 0s [id=2608228920]
data.google_iam_policy.igsr5_daily_invoker: Reading...
data.google_iam_policy.igsr5_daily_invoker: Read complete after 0s [id=1740922505]
data.google_iam_policy.github_project_automation_prototype_invoker: Reading...
data.google_iam_policy.github_project_automation_prototype_invoker: Read complete after 0s [id=2575965494]
google_cloud_run_service_iam_policy.attendance_request_scheduler_sa_policy: Refreshing state... [id=v1/projects/igsr5-368506/locations/asia-northeast1/services/attendance-request-bot]
google_cloud_run_service_iam_policy.github_project_automation_prototype_sa_policy: Refreshing state... [id=v1/projects/igsr5-368506/locations/asia-northeast1/services/github-project-automation-prototype]
google_cloud_run_service_iam_policy.igsr5_daily_sa_policy: Refreshing state... [id=v1/projects/igsr5-368506/locations/asia-northeast1/services/igsr5-daily]
google_cloud_scheduler_job.igsr5_daily: Refreshing state... [id=projects/igsr5-368506/locations/asia-northeast1/jobs/igsr5-daily]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # google_cloud_run_service.github_project_automation_prototype has changed
  ~ resource "google_cloud_run_service" "github_project_automation_prototype" {
        id                         = "locations/asia-northeast1/namespaces/igsr5-368506/services/github-project-automation-prototype"
        name                       = "github-project-automation-prototype"
      ~ status                     = [
          ~ {
              ~ latest_created_revision_name = "github-project-automation-prototype-00007-rrf" -> "github-project-automation-prototype-00008-frr"
              ~ latest_ready_revision_name   = "github-project-automation-prototype-00007-rrf" -> "github-project-automation-prototype-00008-frr"
              ~ observed_generation          = 7 -> 8
                # (2 unchanged attributes hidden)
            },
        ]
        # (3 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # google_cloud_scheduler_job.github_project_automation_prototype will be destroyed
  # (because google_cloud_scheduler_job.github_project_automation_prototype is not in configuration)
  - resource "google_cloud_scheduler_job" "github_project_automation_prototype" {
      - attempt_deadline = "600s" -> null
      - id               = "projects/igsr5-368506/locations/asia-northeast1/jobs/github-project-automation-prototype" -> null
      - name             = "github-project-automation-prototype" -> null
      - paused           = false -> null
      - project          = "igsr5-368506" -> null
      - region           = "asia-northeast1" -> null
      - schedule         = "*/2 * * * *" -> null
      - state            = "ENABLED" -> null
      - time_zone        = "Asia/Tokyo" -> null

      - http_target {
          - headers     = {} -> null
          - http_method = "POST" -> null
          - uri         = "https://github-project-automation-prototype-ibzykqu2gq-an.a.run.app/run" -> null

          - oidc_token {
              - audience              = "https://github-project-automation-prototype-ibzykqu2gq-an.a.run.app" -> null
              - service_account_email = "cloud-run-invoker-sa-g-p-a-p@igsr5-368506.iam.gserviceaccount.com" -> null
            }
        }

      - retry_config {
          - max_backoff_duration = "3600s" -> null
          - max_doublings        = 5 -> null
          - max_retry_duration   = "0s" -> null
          - min_backoff_duration = "5s" -> null
          - retry_count          = 1 -> null
        }
    }

  # google_cloud_scheduler_job.github_project_automation_prototype_issues will be created
  + resource "google_cloud_scheduler_job" "github_project_automation_prototype_issues" {
      + attempt_deadline = "600s"
      + id               = (known after apply)
      + name             = "github-project-automation-prototype"
      + paused           = (known after apply)
      + project          = (known after apply)
      + region           = (known after apply)
      + schedule         = "*/5 * * * *"
      + state            = (known after apply)
      + time_zone        = "Asia/Tokyo"

      + http_target {
          + http_method = "POST"
          + uri         = "https://github-project-automation-prototype-ibzykqu2gq-an.a.run.app/issues"

          + oidc_token {
              + audience              = "https://github-project-automation-prototype-ibzykqu2gq-an.a.run.app"
              + service_account_email = "cloud-run-invoker-sa-g-p-a-p@igsr5-368506.iam.gserviceaccount.com"
            }
        }

      + retry_config {
          + max_backoff_duration = (known after apply)
          + max_doublings        = (known after apply)
          + max_retry_duration   = (known after apply)
          + min_backoff_duration = (known after apply)
          + retry_count          = 1
        }
    }

  # google_cloud_scheduler_job.github_project_automation_prototype_pull_requests will be created
  + resource "google_cloud_scheduler_job" "github_project_automation_prototype_pull_requests" {
      + attempt_deadline = "600s"
      + id               = (known after apply)
      + name             = "github-project-automation-prototype"
      + paused           = (known after apply)
      + project          = (known after apply)
      + region           = (known after apply)
      + schedule         = "*/1 * * * *"
      + state            = (known after apply)
      + time_zone        = "Asia/Tokyo"

      + http_target {
          + http_method = "POST"
          + uri         = "https://github-project-automation-prototype-ibzykqu2gq-an.a.run.app/pull_requests"

          + oidc_token {
              + audience              = "https://github-project-automation-prototype-ibzykqu2gq-an.a.run.app"
              + service_account_email = "cloud-run-invoker-sa-g-p-a-p@igsr5-368506.iam.gserviceaccount.com"
            }
        }

      + retry_config {
          + max_backoff_duration = (known after apply)
          + max_doublings        = (known after apply)
          + max_retry_duration   = (known after apply)
          + min_backoff_duration = (known after apply)
          + retry_count          = 1
        }
    }

  # google_cloud_scheduler_job.github_project_automation_prototype_review_pull_requests will be created
  + resource "google_cloud_scheduler_job" "github_project_automation_prototype_review_pull_requests" {
      + attempt_deadline = "600s"
      + id               = (known after apply)
      + name             = "github-project-automation-prototype"
      + paused           = (known after apply)
      + project          = (known after apply)
      + region           = (known after apply)
      + schedule         = "*/1 * * * *"
      + state            = (known after apply)
      + time_zone        = "Asia/Tokyo"

      + http_target {
          + http_method = "POST"
          + uri         = "https://github-project-automation-prototype-ibzykqu2gq-an.a.run.app/review_pull_requests"

          + oidc_token {
              + audience              = "https://github-project-automation-prototype-ibzykqu2gq-an.a.run.app"
              + service_account_email = "cloud-run-invoker-sa-g-p-a-p@igsr5-368506.iam.gserviceaccount.com"
            }
        }

      + retry_config {
          + max_backoff_duration = (known after apply)
          + max_doublings        = (known after apply)
          + max_retry_duration   = (known after apply)
          + min_backoff_duration = (known after apply)
          + retry_count          = 1
        }
    }

Plan: 3 to add, 0 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @igsr5, Action: `pull_request`*